# Import Libraries

In [2]:
import numpy as np 
import pandas as pd 
import seaborn as sns
import matplotlib.pyplot as plt


Read Dataset

In [7]:
df=pd.read_csv("C:\ds\Excel data\Bank Customer Churn Prediction.csv")

In [8]:
df.head()

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

 Check Datatype

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customer_id       10000 non-null  int64
 1   credit_score      10000 non-null  int64
 2   country           10000 non-null  object
 3   gender            10000 non-null  object
 4   age               10000 non-null  int64
 5   tenure            10000 non-null  int64
 6   balance           10000 non-null  float64
 7   products_number   10000 non-null  int64
 8   credit_card       10000 non-null  int64
 9   active_member     10000 non-null  int64
 10  estimated_salary  10000 non-null  float64
 11  churn             10000 non-null  int64
dtypes: float64(2), int64(8), object(2)
memory usage: 937.6+ KB

Check Null values from dataset

In [10]:
df.isnull().sum()

customer_id         0
credit_score        0
country             0
gender              0
age                 0
tenure              0
balance             0
products_number     0
credit_card         0
active_member       0
estimated_salary    0
churn               0
dtype: int64

Delete unusefull column

In [16]:
df1=df.drop(['customer_id'],axis=1)
df1.head()

,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [20]:
df['country'].nunique()

3

In [21]:
df['gender'].nunique()

2

Lable Encoding

In [25]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
df1["country"]=le.fit_transform(df1["country"])
df1["gender"]=le.fit_transform(df1["gender"])

In [26]:
df1.head(3)

,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,619,0,0,42,2,0.00,1,1,1,101348.88,1
1,608,2,0,41,1,83807.86,1,0,1,112542.58,0
2,502,0,0,42,8,159660.80,3,1,0,113931.57,1

In [29]:
x=df.iloc[:,:-1]
y=df.iloc[:,-1]
x.head(2)

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary
0,15634602,619,0,0,42,2,0.00,1,1,1,101348.88
1,15647311,608,2,0,41,1,83807.86,1,0,1,112542.58

In [30]:
y.head(2)

0    1
1    0
Name: churn, dtype: int64

OR

In [33]:
x=df1.drop(['churn'],axis=1)
y=df1.churn

In [35]:
x.head(2)

,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary
0,619,0,0,42,2,0.00,1,1,1,101348.88
1,608,2,0,41,1,83807.86,1,0,1,112542.58

In [36]:
y.head(2)

0    1
1    0
Name: churn, dtype: int64

In [37]:
df_0=df1[df1['churn']==0]
df_0.head(2)

In [41]:
df_0.shape

(7963, 11)

In [40]:
df_1=df1[df1['churn']==1]
df_1.head(2)

,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,619,0,0,42,2,0.0,1,1,1,101348.88,1
2,502,0,0,42,8,159660.8,3,1,0,113931.57,1

In [42]:
df_1.shape

(2037, 11)

Data balancing technique:SMOTE

Collecting imbalanced_learn
  Downloading imbalanced_learn-0.10.1-py3-none-any.whl (226 kB)
Requirement already satisfied: scipy>=1.3.2 in c:\users\pc\anaconda3\lib\site-packages (from imbalanced_learn) (1.7.3)
Collecting joblib>=1.1.1
  Downloading joblib-1.2.0-py3-none-any.whl (297 kB)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\pc\anaconda3\lib\site-packages (from imbalanced_learn) (2.2.0)
Requirement already satisfied: numpy>=1.17.3 in c:\users\pc\anaconda3\lib\site-packages (from imbalanced_learn) (1.21.5)
Requirement already satisfied: scikit-learn>=1.0.2 in c:\users\pc\anaconda3\lib\site-packages (from imbalanced_learn) (1.0.2)
Installing collected packages: joblib, imbalanced-learn
  Attempting uninstall: joblib
    Found existing installation: joblib 1.1.0
    Uninstalling joblib-1.1.0:
      Successfully uninstalled joblib-1.1.0
Successfully installed imbalanced-learn-0.10.1 joblib-1.2.0